public class Main {

    public static void main(String[] args) {
        //객체지향 이론의 관점에서 클래스는 '객체를 생성하기 위한 틀' 이고, '클래스는 속성과 기능으로 정의되어있다.'
        //static이 붙은 변수 : 클래스변수 . static이 붙지않은 것은 인스턴스변수
        //클래스 변수를 사용할 때는 클래스이름.클래스변수의 형태로 하는 것이 좋다. Ex) Card.width. 인스턴스변수로 오해방지.
        // 같은 내용의 문장들이 여러 곳에 반복해서 나타날 경우 함수를 호출하는 한 문장으로 대체하는 것이 좋다.
        // 재귀호출이 몇겹의 반복문과 조건문보다 단순한 구조로 바뀔 수 있다.
        //static함수는 인스턴스 함수를 호출할 수 없다.
        //클래스멤버가 인스턴스멤버를 참조, 호출하기 위해서는 객체를 생성하여야 한다.
    }
}
